In [1]:
import pandas as pd
import numpy as np

In [2]:
db=pd.read_csv('students_data.csv')
db

      student_id             name    subject  score        date  attendance
0            109     Janice Ortiz   Computer   72.0  10/25/2024          35
1            142   Chelsea Wilson   Computer    NaN    9/2/2025          27
2            156    Curtis Rivera    English   94.0   6/30/2025          40
3            125  Deborah Schmidt    English    NaN  12/29/2024          26
4            115      Ruben Mccoy    English    NaN   6/24/2025          24
...          ...              ...        ...    ...         ...         ...
1535         196    Lauren Walker   Computer   70.0   3/24/2025          24
1536         147     Jonathan May    English   77.0   4/10/2025          31
1537         120      Michael Kim       Math    NaN    1/2/2025          38
1538         159      Hannah Todd  Geography   40.0   7/31/2025          28
1539         136     Lydia Miller   Computer   60.0   10/9/2024          24

[1540 rows x 6 columns]

In [3]:
db.head()

   student_id             name   subject  score        date  attendance
0         109     Janice Ortiz  Computer   72.0  10/25/2024          35
1         142   Chelsea Wilson  Computer    NaN    9/2/2025          27
2         156    Curtis Rivera   English   94.0   6/30/2025          40
3         125  Deborah Schmidt   English    NaN  12/29/2024          26
4         115      Ruben Mccoy   English    NaN   6/24/2025          24

In [4]:
db.describe()

        student_id        score   attendance
count  1540.000000  1037.000000  1540.000000
mean    109.600649    70.928640    30.107792
std      63.051107    18.009455     6.103084
min       1.000000    40.000000    20.000000
25%      40.000000    55.000000    25.000000
50%     124.500000    72.000000    30.000000
75%     163.000000    87.000000    36.000000
max     199.000000   100.000000    40.000000

In [5]:
db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1540 entries, 0 to 1539
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  1540 non-null   int64
 1   name        1540 non-null   object
 2   subject     1540 non-null   object
 3   score       1037 non-null   float64
 4   date        1506 non-null   object
 5   attendance  1540 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 72.3+ KB

In [6]:
db[db.duplicated()]

      student_id               name  subject  score       date  attendance
21           177          Chad Diaz  History  100.0  9/19/2025          21
1332         100          Tina Bass  English    NaN  2/17/2025          25
1352         104  Phillip Gutierrez  English   59.0  5/15/2025          20

In [7]:
db.duplicated().sum()

np.int64(3)

In [8]:
db=db.drop_duplicates()

In [9]:
db.duplicated().sum()

np.int64(0)

In [10]:
db.shape

(1537, 6)

In [11]:
db.isnull().sum()

student_id      0
name            0
subject         0
score         502
date           34
attendance      0
dtype: int64

In [12]:
db.loc[:, "attendance"] = db["attendance"].fillna("Absent")

In [13]:
db.head()

   student_id             name   subject  score        date  attendance
0         109     Janice Ortiz  Computer   72.0  10/25/2024          35
1         142   Chelsea Wilson  Computer    NaN    9/2/2025          27
2         156    Curtis Rivera   English   94.0   6/30/2025          40
3         125  Deborah Schmidt   English    NaN  12/29/2024          26
4         115      Ruben Mccoy   English    NaN   6/24/2025          24

In [14]:
db.isnull().sum()

student_id      0
name            0
subject         0
score         502
date           34
attendance      0
dtype: int64

In [15]:
db=db.dropna()

In [16]:
db.isnull().sum()

student_id    0
name          0
subject       0
score         0
date          0
attendance    0
dtype: int64

In [17]:
db.dtypes

student_id      int64
name           object
subject        object
score         float64
date           object
attendance      int64
dtype: object

In [18]:
db['date']=pd.to_datetime(db['date'])

ValueError: time data "25-Jan" doesn't match format "%m/%d/%Y", at position 761. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [19]:
db['date'] = db['date'].replace("Jan-25", "1/25/2025")

In [20]:
db['date']=pd.to_datetime(db['date'])

ValueError: time data "25-Jan" doesn't match format "%m/%d/%Y", at position 761. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [21]:
db['date'] = db['date'].replace("missing_date", "1/25/2025")

In [22]:
db['date']=pd.to_datetime(db['date'])

ValueError: time data "25-Jan" doesn't match format "%m/%d/%Y", at position 761. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [23]:
db['date'] = db['date'].replace("25-Jan", "1/25/2025")

In [24]:
db['date']=pd.to_datetime(db['date'])

In [25]:
db.dtypes

student_id             int64
name                  object
subject               object
score                float64
date          datetime64[ns]
attendance             int64
dtype: object

In [26]:
def categorize(score):
    if score >= 85:
        return "High"
    elif score >= 70:
        return "Medium"
    else:
        return "Low"

db["performance_category"] = db["score"].apply(categorize)

In [27]:
db.head()

,student_id,name,subject,score,date,attendance,performance_category
0,109,Janice Ortiz,Computer,72.0,2024-10-25,35,Medium
2,156,Curtis Rivera,English,94.0,2025-06-30,40,High
5,177,Chad Diaz,History,100.0,2025-09-19,21,High
8,132,Aaron Wilson,History,53.0,2024-11-26,33,Low
9,160,Danielle Barron,Computer,68.0,2025-04-18,24,Low

In [28]:
db.to_csv("cleaned_students_data.csv", index=False)